app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "mangareader"], ["url", "http://www.mangareader.net/"], ["user_id", 1], ["created_at", "2015-06-13 12:30:09.533209"], ["updated_at", "2015-06-13 12:30:09.533209"]]